app/views/recipes/_form.html.erb

SELECT  "recipes".* FROM "recipes"  ORDER BY "recipes"."id" DESC LIMIT 1
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 9]]
---

  <%@recipe.recipe_ingredients.each do |recipe_ingredient|%>