app/views/recipes/show.html.erb


  <%@recipe.recipe_ingredients.each do |recipe_ingredient|%>
---
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 11]]

  <h1>Comments</h1>
  <% @recipe.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 26]]