app/controllers/comments_controller.rb

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
---
  def destroy
    @recipe = @comment.recipe
    authorize(@comment)
    @comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_comment
      if Comment.exists?(params[:id])
        @comment = Comment.find(params[:id])