app/controllers/recipes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
SELECT "recipes".* FROM "recipes"
---
  def index
    if !!params[:user_id]
      @recipes = User.find(params[:user_id]).recipes
    else
      @recipes = Recipe.all

UPDATE "recipes" SET "name" = ?, "content" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "New recipe"], ["content", "New descripion"], ["updated_at", "2016-02-26 15:27:59.053757"], ["id", 40]]
---
  def update
    @recipe.update(recipe_params)

SELECT  "recipes".* FROM "recipes"  ORDER BY "recipes"."id" DESC LIMIT 1
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 14]]
---
    def set_recipe
      if Recipe.exists?(params[:id])
        @recipe = Recipe.find(params[:id])